Repository: willibrandon/AccessibleColors
Catalog: src/AccessibleColors.UI/Properties/Resources.*.resx
Languages: de, es, fr, ja, ko, pt_br, zh_hans

# MainForm_Title
source: Accessible Colors Tool
de: Barrierefreies Farbwerkzeug
es: Herramienta de Colores Accesibles
fr: Outil de Couleurs Accessibles
ja: アクセシブルカラー ツール
ko: 접근성 색상 도구
pt_br: Ferramenta de Cores Acessíveis
zh_hans: 无障碍颜色工具

# Heading_Text
source: AccessibleColors: WCAG-Compliant Contrast Colors
de: AccessibleColors: WCAG-konforme Kontrastfarben
es: AccessibleColors: Colores de Contraste Cumplidos con WCAG
fr: AccessibleColors : Couleurs de Contraste Conformes WCAG
ja: AccessibleColors: WCAG準拠のコントラストカラー
ko: AccessibleColors: WCAG 준수 대비 색상
pt_br: AccessibleColors: Cores de Contraste Compatíveis com WCAG
zh_hans: AccessibleColors: 符合WCAG的对比色

# Explanation_Heading
source: Explanation
de: Erläuterung
es: Explicación
fr: Explication
ja: 説明
ko: 설명
pt_br: Explicação
zh_hans: 说明

# Explanation_Body
source: Enter a foreground and background color in RGB hexadecimal format or choose a color using the Color Picker. Use the Lightness slider to adjust the perceived lightness of the color. WCAG 2.0 level AA requires a contrast ratio of at least 4.5:1 for normal text and 3:1 for large text. WCAG 2.1 requires a contrast ratio of at least 3:1 for graphics and user interface components (such as form input borders). WCAG Level AAA requires a contrast ratio of at least 7:1 for normal text and 4.5:1 for large text. Large text is defined as 14 point (typically 18.66px) and bold or larger, or 18 point (typically 24px) or larger.
de: Geben Sie eine Vorder- und Hintergrundfarbe im RGB-Hexadezimalformat ein oder wählen Sie eine Farbe mit dem Farbwähler. Verwenden Sie den Helligkeitsregler, um die wahrgenommene Helligkeit der Farbe anzupassen. WCAG 2.0 Level AA erfordert ein Kontrastverhältnis von mindestens 4,5:1 für normalen Text und 3:1 für großen Text. WCAG 2.1 erfordert ein Kontrastverhältnis von mindestens 3:1 für Grafiken und UI-Komponenten. WCAG Level AAA erfordert ein Kontrastverhältnis von mindestens 7:1 für normalen Text und 4,5:1 für großen Text. Großer Text ist definiert als 14 Punkt (ca. 18,66px) fett oder größer, oder 18 Punkt (ca. 24px) oder größer.
es: Ingrese un color de primer plano y de fondo en formato hexadecimal RGB o elija un color usando el selector de color. Use el control deslizante de brillo para ajustar la claridad percibida del color. WCAG 2.0 nivel AA requiere una relación de contraste de al menos 4,5:1 para texto normal y 3:1 para texto grande. WCAG 2.1 requiere una relación de contraste de al menos 3:1 para gráficos y componentes de interfaz de usuario. WCAG nivel AAA requiere una relación de contraste de al menos 7:1 para texto normal y 4,5:1 para texto grande. Se define el texto grande como 14 puntos (aprox. 18,66px) en negrita o mayor, o 18 puntos (aprox. 24px) o mayor.
fr: Saisissez une couleur de premier plan et d’arrière-plan au format hexadécimal RGB ou choisissez une couleur à l’aide du sélecteur de couleurs. Utilisez le curseur de luminosité pour ajuster la clarté perçue de la couleur. Le niveau AA de WCAG 2.0 exige un ratio de contraste d’au moins 4,5:1 pour le texte normal et 3:1 pour le texte de grande taille. WCAG 2.1 exige un ratio de contraste d’au moins 3:1 pour les graphiques et les composants d’interface utilisateur. Le niveau AAA de WCAG exige un ratio de contraste d’au moins 7:1 pour le texte normal et 4,5:1 pour le texte de grande taille. Le texte de grande taille est défini comme étant de 14 points (environ 18,66 px) en gras ou plus, ou de 18 points (environ 24 px) ou plus.
ja: 前景色と背景色をRGBの16進形式で入力するか、カラーピッカーを使用して色を選択してください。明度スライダーを使って、色の知覚的な明るさを調整できます。 WCAG 2.0レベルAAは、通常のテキストに少なくとも4.5:1、大きなテキストに少なくとも3:1のコントラスト比が必要です。WCAG 2.1では、グラフィックスやUIコンポーネントに少なくとも3:1が必要となります。WCAGレベルAAAでは、通常のテキストで少なくとも7:1、大きなテキストで少なくとも4.5:1が求められます。 大きなテキストとは、14ポイント（約18.66px）以上で太字、または18ポイント（約24px）以上のテキストを指します。
ko: RGB 16진수 형식으로 전경색과 배경색을 입력하거나 색상 선택기를 사용하여 색상을 선택하십시오. 밝기 슬라이더를 사용하여 색상의 인지적 밝기를 조정할 수 있습니다. WCAG 2.0 AA 수준은 일반 텍스트에 대해 최소 4.5:1의 대비 비율, 큰 텍스트에 대해 최소 3:1을 요구합니다. WCAG 2.1은 그래픽 및 UI 구성 요소에 대해 최소 3:1의 대비 비율을 요구합니다. WCAG AAA 수준은 일반 텍스트에 대해 최소 7:1, 큰 텍스트에 대해 최소 4.5:1의 대비 비율을 요구합니다. "큰 텍스트"는 14포인트(약 18.66px) 이상 굵은 텍스트 또는 18포인트(약 24px) 이상을 의미합니다.
pt_br: Insira uma cor de primeiro plano e de plano de fundo em formato hexadecimal RGB ou escolha uma cor usando o seletor de cores. Use o controle deslizante de luminosidade para ajustar a claridade percebida da cor. O nível AA do WCAG 2.0 requer uma proporção de contraste de pelo menos 4,5:1 para texto normal e 3:1 para texto grande. O WCAG 2.1 requer uma proporção de contraste de pelo menos 3:1 para gráficos e componentes da interface do usuário. O nível AAA do WCAG requer uma proporção de contraste de pelo menos 7:1 para texto normal e 4,5:1 para texto grande. Texto grande é definido como 14 pontos (aprox. 18,66px) em negrito ou maior, ou 18 pontos (aprox. 24px) ou maior.
zh_hans: 以RGB十六进制格式输入前景色和背景色，或使用颜色选择器选择颜色。使用亮度滑块调整颜色的感知亮度。 WCAG 2.0 AA级要求正常文本的对比度至少为4.5:1，较大文本为3:1。WCAG 2.1要求图形和UI组件的对比度至少为3:1。WCAG AAA级要求正常文本至少7:1的对比度，较大文本至少4.5:1。 “大文本”定义为14磅（约18.66px）加粗或更大，或18磅（约24px）或更大。

# ForegroundColor_Label
source: Color (#RRGGBB):
de: Farbe (#RRGGBB):
fr: Couleur (#RRGGBB) :
ja: カラー (#RRGGBB)：
ko: 색상 (#RRGGBB):
pt_br: Cor (#RRGGBB):
zh_hans: 颜色 (#RRGGBB)：

# BackgroundColor_Label
source: Color (#RRGGBB):
de: Farbe (#RRGGBB):
fr: Couleur (#RRGGBB) :
ja: カラー (#RRGGBB)：
ko: 색상 (#RRGGBB):
pt_br: Cor (#RRGGBB):
zh_hans: 颜色 (#RRGGBB)：

# Alpha_Label
source: Alpha (0-255):
es: Alfa (0-255):
ja: アルファ (0-255)：
ko: 알파 (0-255):
pt_br: Alfa (0-255):

# Lightness_Label
source: Lightness:
de: Helligkeit:
es: Brillo:
fr: Luminosité :
ja: 明度：
ko: 명도:
pt_br: Luminosidade:
zh_hans: 亮度：

# TextSize_Label
source: Text Size (pt):
de: Textgröße (pt):
es: Tamaño de texto (pt):
fr: Taille du texte (pt) :
ja: テキストサイズ (pt)：
ko: 텍스트 크기 (pt):
pt_br: Tamanho do Texto (pt):
zh_hans: 文字大小 (pt)：

# SampleText_Label
source: Sample Text:
de: Beispieltext:
es: Texto de muestra:
fr: Texte d’exemple :
ja: サンプルテキスト：
ko: 샘플 텍스트:
pt_br: Texto de Exemplo:
zh_hans: 示例文本：

# Bold_Checkbox
source: Bold
de: Fett
es: Negrita
fr: Gras
ja: 太字
ko: 굵게
pt_br: Negrito
zh_hans: 加粗

# ColorPicker_Button
source: Color Picker
de: Farbwähler
es: Selector de Color
fr: Sélecteur de Couleur
ja: カラーピッカー
ko: 색상 선택기
pt_br: Seletor de Cores
zh_hans: 颜色选择器

# EyeDropper_Button
source: Eye Dropper
de: Farbpipette
es: Cuentagotas
fr: Pipette
ja: スポイト
ko: 스포이트
pt_br: Conta-gotas
zh_hans: 取色器

# SavePalette_Button
source: Save Palette
de: Palette speichern
es: Guardar Paleta
fr: Enregistrer la Palette
ja: パレットを保存
ko: 팔레트 저장
pt_br: Salvar Paleta
zh_hans: 保存调色板

# LoadPalette_Button
source: Load Palette
de: Palette laden
es: Cargar Paleta
fr: Charger la Palette
ja: パレットを読み込み
ko: 팔레트 로드
pt_br: Carregar Paleta
zh_hans: 加载调色板

# LoadPalette_DialogTitle
source: Load Palette
de: Palette laden
es: Cargar Paleta
fr: Charger la Palette
ja: パレットを読み込み
ko: 팔레트 로드
pt_br: Carregar Paleta
zh_hans: 加载调色板

# SavePalette_DialogTitle
source: Save Palette
de: Palette speichern
es: Guardar Paleta
fr: Enregistrer la Palette
ja: パレットを保存
ko: 팔레트 저장
pt_br: Salvar Paleta
zh_hans: 保存调色板

# ContrastRatio_Format
source: Contrast Ratio: {0:F2}:1
de: Kontrastverhältnis: {0:F2}:1
es: Relación de Contraste: {0:F2}:1
fr: Ratio de Contraste : {0:F2}:1
ja: コントラスト比：{0:F2}:1
ko: 명암비: {0:F2}:1
pt_br: Taxa de Contraste: {0:F2}:1
zh_hans: 对比度：{0:F2}:1

# Compliance_Compliant
source: WCAG AA Compliant for specified text size/weight
de: WCAG AA konform für die angegebene Textgröße/Gewicht
es: Conforme a WCAG AA para el tamaño/peso de texto especificado
fr: Conforme WCAG AA pour la taille/poids de texte spécifiés
ja: 指定されたテキストサイズ／ウェイトでWCAG AA準拠
ko: 지정된 텍스트 크기/굵기에 대해 WCAG AA 준수
pt_br: Compatível com WCAG AA para o tamanho/peso de texto especificado
zh_hans: 对于指定的文本大小/样式，符合WCAG AA

# Compliance_NotCompliant
source: Not Compliant
de: Nicht konform
es: No Cumple
fr: Non Conform
ja: 非準拠
ko: 비준수
pt_br: Não Compatível
zh_hans: 不符合要求

# ContrastRatio_InvalidInput
source: Invalid Input
de: Ungültige Eingabe
es: Entrada Inválida
fr: Entrée Invalide
ja: 無効な入力
ko: 잘못된 입력
pt_br: Entrada Inválida
zh_hans: 无效输入

# Tooltip_ForegroundColor
source: Enter the foreground color in #RRGGBB format.
de: Geben Sie die Vordergrundfarbe im Format #RRGGBB ein.
es: Ingrese el color de primer plano en formato #RRGGBB.
fr: Saisissez la couleur de premier plan au format #RRGGBB.
ja: 前景色を#RRGGBB形式で入力してください。
ko: #RRGGBB 형식으로 전경색을 입력하십시오.
pt_br: Insira a cor do primeiro plano no formato #RRGGBB.
zh_hans: 以#RRGGBB格式输入前景色。

# Tooltip_ForegroundPicker
source: Open a color picker dialog to select the foreground color.
de: Öffnen Sie einen Farbwähler, um die Vordergrundfarbe auszuwählen.
es: Abra un selector de color para elegir el color de primer plano.
fr: Ouvrir un sélecteur de couleurs pour choisir la couleur de premier plan.
ja: カラーダイアログを開いて前景色を選択します。
ko: 전경색을 선택하기 위해 색상 선택기 대화 상자를 엽니다.
pt_br: Abra um seletor de cores para escolher a cor do primeiro plano.
zh_hans: 打开颜色选择器对话框来选择前景色。

# Tooltip_ForegroundEyedropper
source: Use the eyedropper to pick a color from anywhere on your screen.
de: Verwenden Sie die Pipette, um eine Farbe von Ihrem Bildschirm auszuwählen.
es: Use el cuentagotas para tomar un color de cualquier lugar de la pantalla.
fr: Utilisez la pipette pour prélever une couleur n’importe où sur votre écran.
ja: スポイトを使って、画面上の任意の色を取得します。
ko: 화면 어디에서나 색상을 선택하기 위해 스포이트를 사용하십시오.
pt_br: Use o conta-gotas para selecionar uma cor de qualquer lugar na sua tela.
zh_hans: 使用取色器从屏幕上的任何位置拾取颜色。

# Tooltip_Alpha
source: Adjust the transparency (0-255) of the color.
de: Stellen Sie die Transparenz (0-255) der Farbe ein.
es: Ajuste la transparencia (0-255) del color.
fr: Ajustez la transparence (0-255) de la couleur.
ja: 色の透過度(0-255)を調整します。
ko: 색상의 투명도(0-255)를 조정하십시오.
pt_br: Ajuste a transparência (0-255) da cor.
zh_hans: 调整颜色的透明度(0-255)。

# Tooltip_ForegroundLightness
source: Adjust the perceived lightness of the foreground color.
de: Stellen Sie die wahrgenommene Helligkeit der Vordergrundfarbe ein.
es: Ajuste el brillo percibido del color de primer plano.
fr: Ajustez la luminosité perçue de la couleur de premier plan.
ja: 前景色の知覚的な明度を調整します。
ko: 전경색의 인지적 밝기를 조정하십시오.
pt_br: Ajuste a luminosidade percebida da cor do primeiro plano.
zh_hans: 调整前景色的感知亮度。

# Tooltip_BackgroundColor
source: Enter the background color in #RRGGBB format.
de: Geben Sie die Hintergrundfarbe im Format #RRGGBB ein.
es: Ingrese el color de fondo en formato #RRGGBB.
fr: Saisissez la couleur d’arrière-plan au format #RRGGBB.
ja: 背景色を#RRGGBB形式で入力してください。
ko: #RRGGBB 형식으로 배경색을 입력하십시오.
pt_br: Insira a cor de fundo no formato #RRGGBB.
zh_hans: 以#RRGGBB格式输入背景色。

# Tooltip_BackgroundPicker
source: Open a color picker dialog to select the background color.
de: Öffnen Sie einen Farbwähler, um die Hintergrundfarbe auszuwählen.
es: Abra un selector de color para elegir el color de fondo.
fr: Ouvrir un sélecteur de couleurs pour choisir la couleur d’arrière-plan.
ja: カラーダイアログを開いて背景色を選択します。
ko: 배경색을 선택하기 위해 색상 선택기 대화 상자를 엽니다.
pt_br: Abra um seletor de cores para escolher a cor de fundo.
zh_hans: 打开颜色选择器对话框来选择背景色。

# Tooltip_BackgroundEyedropper
source: Use the eyedropper to pick a background color from anywhere on your screen.
de: Verwenden Sie die Pipette, um eine Hintergrundfarbe von Ihrem Bildschirm auszuwählen.
es: Use el cuentagotas para tomar un color de fondo de cualquier lugar de la pantalla.
fr: Utilisez la pipette pour prélever une couleur d’arrière-plan n’importe où sur votre écran.
ja: スポイトを使って、画面上の任意の場所から背景色を取得します。
ko: 화면에서 배경색을 선택하기 위해 스포이트를 사용하십시오.
pt_br: Use o conta-gotas para selecionar uma cor de fundo de qualquer lugar na tela.
zh_hans: 使用取色器从屏幕上的任何位置拾取背景色。

# Tooltip_BackgroundLightness
source: Adjust the perceived lightness of the background color.
de: Stellen Sie die wahrgenommene Helligkeit der Hintergrundfarbe ein.
es: Ajuste el brillo percibido del color de fondo.
fr: Ajustez la luminosité perçue de la couleur d’arrière-plan.
ja: 背景色の知覚的な明度を調整します。
ko: 배경색의 인지적 밝기를 조정하십시오.
pt_br: Ajuste a luminosidade percebida da cor de fundo.
zh_hans: 调整背景色的感知亮度。

# Tooltip_TextSize
source: Set the text size in points. Large text has looser contrast requirements.
de: Stellen Sie die Textgröße in Punkten ein. Großer Text hat geringere Kontrastanforderungen.
es: Establezca el tamaño del texto en puntos. El texto grande tiene requisitos de contraste menos estrictos.
fr: Définissez la taille du texte en points. Le texte de grande taille a des exigences de contraste moins strictes.
ja: テキストサイズをポイントで設定します。大きなテキストには緩和されたコントラスト要件があります。
ko: 텍스트 크기를 포인트 단위로 설정하십시오. 큰 텍스트는 대비 요구사항이 덜 엄격합니다.
pt_br: Defina o tamanho do texto em pontos. Texto grande possui requisitos de contraste menos rígidos.
zh_hans: 以点为单位设置文本大小。较大文本的对比要求较低。

# Tooltip_Bold
source: Check if the text is bold. Bold >= 14pt is considered large text.
de: Aktivieren Sie, wenn der Text fett ist. Fett ≥14pt gilt als großer Text.
es: Marque si el texto es en negrita. Negrita ≥14pt se considera texto grande.
fr: Cochez si le texte est en gras. Le gras ≥14pt est considéré comme texte de grande taille.
ja: テキストが太字の場合にチェック。太字≥14ptは大きなテキストと見なされます。
ko: 텍스트가 굵은 경우 체크하십시오. 굵게≥14pt는 큰 텍스트로 간주합니다.
pt_br: Marque se o texto for em negrito. Negrito ≥14pt é considerado texto grande.
zh_hans: 勾选此项则文本加粗。加粗≥14pt被视为大文本。

# Tooltip_SampleText
source: Enter your own sample text to preview.
de: Geben Sie eigenen Beispieltext ein, um eine Vorschau anzuzeigen.
es: Ingrese su propio texto de muestra para previsualizar.
fr: Saisissez votre propre texte d’exemple à prévisualiser.
ja: プレビューするために独自のサンプルテキストを入力してください。
ko: 미리보기를 위해 사용자 정의 샘플 텍스트를 입력하십시오.
pt_br: Insira seu próprio texto de exemplo para visualizar.
zh_hans: 输入自定义示例文本以进行预览。

# Tooltip_SavePalette
source: Save the current colors, text settings, and sample text as a JSON file.
de: Speichern Sie die aktuellen Farben, Texteinstellungen und Beispieltext in einer JSON-Datei.
es: Guarde los colores actuales, la configuración de texto y el texto de muestra en un archivo JSON.
fr: Enregistrez les couleurs actuelles, les réglages de texte et le texte d’exemple au format JSON.
ja: 現在のカラー設定、テキスト設定、およびサンプルテキストをJSONファイルとして保存します。
ko: 현재 색상, 텍스트 설정 및 샘플 텍스트를 JSON 파일로 저장하십시오.
pt_br: Salve as cores atuais, configurações de texto e texto de exemplo em um arquivo JSON.
zh_hans: 将当前颜色、文本设置和示例文本保存为JSON文件。

# Tooltip_LoadPalette
source: Load previously saved palette settings from a JSON file.
de: Laden Sie zuvor gespeicherte Paletteneinstellungen aus einer JSON-Datei.
es: Cargue una configuración de paleta guardada anteriormente desde un archivo JSON.
fr: Chargez une palette précédemment enregistrée à partir d’un fichier JSON.
ja: 以前に保存したパレット設定をJSONファイルから読み込みます。
ko: 이전에 저장한 팔레트 설정을 JSON 파일에서 로드하십시오.
pt_br: Carregue as configurações de paleta previamente salvas a partir de um arquivo JSON.
zh_hans: 从JSON文件中加载之前保存的调色板设置。
